---
kind: type
id: T:Autodesk.Revit.DB.Electrical.WireConduitTypeSet
source: html/08d0cc98-554e-7f81-cb7c-f827d925de7d.htm
---
# Autodesk.Revit.DB.Electrical.WireConduitTypeSet

A set that contains conduit types.

## Syntax (C#)
```csharp
public class WireConduitTypeSet : APIObject,
	IEnumerable
```